RorreLataf/conditioner/stm32g030_adc_example.c
/**
 * @file stm32g030_adc_example.c
 * @brief Пример использования АЦП STM32G030F6P6 с CMSIS
 * 
 * Основано на RM0444 (Reference Manual для STM32G0)
 * 
 * STM32G030F6P6 имеет:
 * - 12-bit ADC (ADC1)
 * - До 16 каналов (в зависимости от пакета)
 * - Встроенный регулятор напряжения (ADVREGEN)
 * - Калибровка встроенная
 */

#include "stm32g0xx.h"

/**
 * @brief Инициализация АЦП для одиночного преобразования на канале 0 (PA0)
 * 
 * Последовательность согласно RM0444:
 * 1. Включить тактирование GPIO и ADC
 * 2. Настроить GPIO в аналоговый режим
 * 3. Включить регулятор напряжения ADC (ADVREGEN)
 * 4. Подождать стабилизации регулятора
 * 5. Выполнить калибровку
 * 6. Настроить параметры ADC
 * 7. Включить ADC (ADEN)
 * 8. Дождаться готовности (ADRDY)
 */
void ADC1_Init_Single_PA0(void)
{
    /* ========== 1. Включение тактирования ========== */
    // Включить тактирование GPIOA
    RCC->IOPENR |= RCC_IOPENR_GPIOAEN;
    
    // Включить тактирование ADC1
    RCC->AHBENR |= RCC_AHBENR_ADCEN;
    
    // Небольшая задержка для стабилизации тактирования
    __NOP(); __NOP(); __NOP();
    
    /* ========== 2. Настройка GPIO PA0 в аналоговый режим ========== */
    // PA0 = ADC1_IN0
    // MODER[1:0] = 11 (аналоговый режим)
    // Для STM32G0: MODER[1:0] = 0b11 для аналогового режима
    GPIOA->MODER &= ~(GPIO_MODER_MODE0_Msk);
    GPIOA->MODER |= (GPIO_MODER_MODE0_1 | GPIO_MODER_MODE0_0);  // 11 = аналоговый
    
    // Отключить подтяжки (PUPDR[1:0] = 00)
    GPIOA->PUPDR &= ~(GPIO_PUPDR_PUPD0_Msk);
    
    /* ========== 3. Отключение ADC, если был включен ========== */
    // Если ADC уже включен, сначала отключить
    if (ADC1->CR & ADC_CR_ADEN)
    {
        // Запустить отключение
        ADC1->CR |= ADC_CR_ADDIS;
        // Дождаться полного отключения
        while (ADC1->CR & ADC_CR_ADEN) { __NOP(); }
    }
    
    /* ========== 4. Включение регулятора напряжения ADC ========== */
    // ADVREGEN должен быть включен перед калибровкой и использованием ADC
    ADC1->CR |= ADC_CR_ADVREGEN;
    
    // Подождать стабилизации регулятора (минимум 10 мкс согласно RM)
    // Для тактовой частоты ~16 МГц: ~160 тактов
    // Используем задержку с запасом
    volatile uint32_t delay = 200;
    while (delay--) { __NOP(); }
    
    // Дополнительная проверка готовности регулятора (если доступен флаг)
    // Для некоторых ревизий STM32G0 может быть флаг ADVREGEN в ISR
    
    /* ========== 5. Калибровка ADC ========== */
    // Запустить калибровку
    ADC1->CR |= ADC_CR_ADCAL;
    
    // Дождаться окончания калибровки
    // Флаг ADCAL сбрасывается автоматически по завершении
    while (ADC1->CR & ADC_CR_ADCAL) { __NOP(); }
    
    /* ========== 6. Настройка параметров ADC ========== */
    
    // 6.1. Настройка источника тактирования (CFGR2)
    // CKMODE[1:0]:
    //   00 = Asynchronous (асинхронный)
    //   01 = Synchronous PCLK/2 (синхронный, PCLK/2)
    //   10 = Synchronous PCLK/4 (синхронный, PCLK/4)
    //   11 = Synchronous PCLK (синхронный, PCLK)
    // Используем синхронный режим PCLK/2 (рекомендуется)
    ADC1->CFGR2 &= ~ADC_CFGR2_CKMODE_Msk;
    ADC1->CFGR2 |= (0x1UL << ADC_CFGR2_CKMODE_Pos);  // PCLK/2
    
    // 6.2. Настройка времени выборки (SMPR)
    // Для STM32G0: SMPR устанавливает время выборки для всех каналов
    // SMP[2:0]:
    //   000 = 2.5 ADC clock cycles
    //   001 = 6.5 ADC clock cycles
    //   010 = 12.5 ADC clock cycles
    //   011 = 24.5 ADC clock cycles
    //   100 = 47.5 ADC clock cycles
    //   101 = 92.5 ADC clock cycles
    //   110 = 247.5 ADC clock cycles
    //   111 = 640.5 ADC clock cycles (максимальное)
    // Используем максимальное время выборки для точности
    ADC1->SMPR = ADC_SMPR_SMP_0 | ADC_SMPR_SMP_1 | ADC_SMPR_SMP_2;  // 111 = 640.5 cycles
    // Альтернативный способ (если макросы не определены):
    // ADC1->SMPR = (7UL << ADC_SMPR_SMP_Pos);  // 111 = максимальное время выборки
    
    // 6.3. Выбор канала для преобразования (CHSELR)
    // CHSEL0 = канал 0 (PA0 = ADC1_IN0)
    // Для одиночного канала устанавливаем только CHSEL0
    ADC1->CHSELR = 0;
    ADC1->CHSELR |= ADC_CHSELR_CHSEL0;
    // Альтернативный способ (если макрос не определен):
    // ADC1->CHSELR = (1UL << 0);  // CHSEL0
    
    // 6.4. Настройка режима работы (CFGR1)
    // Одиночное преобразование (CONT = 0, по умолчанию)
    // Разрешение 12 бит (RES[1:0] = 00, по умолчанию)
    // Выравнивание вправо (ALIGN = 0, по умолчанию)
    // Одиночное преобразование (SCANDIR = 0, по умолчанию)
    ADC1->CFGR1 = 0;  // Все по умолчанию - одиночное преобразование, 12 бит, выравнивание вправо
    
    /* ========== 7. Включение ADC ========== */
    // Сбросить флаг ADRDY (если был установлен)
    ADC1->ISR |= ADC_ISR_ADRDY;
    
    // Включить ADC
    ADC1->CR |= ADC_CR_ADEN;
    
    // Дождаться готовности ADC (флаг ADRDY)
    while (!(ADC1->ISR & ADC_ISR_ADRDY)) { __NOP(); }
    
    // ADC готов к работе
}

/**
 * @brief Выполнить одиночное преобразование ADC
 * @return 12-битное значение ADC (0-4095)
 * 
 * Последовательность:
 * 1. Запустить преобразование (ADSTART)
 * 2. Дождаться окончания (EOC)
 * 3. Прочитать результат (DR)
 */
uint16_t ADC1_ReadOnce(void)
{
    /* 1. Запуск преобразования */
    ADC1->CR |= ADC_CR_ADSTART;
    
    /* 2. Ожидание окончания преобразования */
    // Флаг EOC устанавливается когда преобразование завершено
    while (!(ADC1->ISR & ADC_ISR_EOC)) { __NOP(); }
    
    /* 3. Чтение результата */
    // Чтение DR автоматически сбрасывает флаг EOC
    uint16_t result = (uint16_t)(ADC1->DR & 0x0FFFU);  // 12 бит
    
    return result;
}

/**
 * @brief Конвертировать значение ADC в напряжение
 * @param adc_value Значение ADC (0-4095)
 * @param vref_mv Опорное напряжение в милливольтах (обычно 3300 для 3.3В)
 * @return Напряжение в милливольтах
 */
uint32_t ADC_ToVoltage_mV(uint16_t adc_value, uint32_t vref_mv)
{
    // V = (ADC_value / 4095) * Vref
    return ((uint32_t)adc_value * vref_mv) / 4095U;
}

/**
 * @brief Пример использования с несколькими каналами
 * @param channel Номер канала (0-15)
 * @return Значение ADC
 */
uint16_t ADC1_ReadChannel(uint8_t channel)
{
    // Проверка допустимого канала
    if (channel > 15) return 0;
    
    // Выбор канала (очистить предыдущий выбор)
    ADC1->CHSELR = 0;
    // Установить выбранный канал
    ADC1->CHSELR |= (1UL << channel);
    
    // Небольшая задержка для установки канала
    __NOP(); __NOP();
    
    // Запуск преобразования
    ADC1->CR |= ADC_CR_ADSTART;
    
    // Ожидание окончания
    while (!(ADC1->ISR & ADC_ISR_EOC)) { __NOP(); }
    
    // Чтение результата (автоматически сбрасывает EOC)
    return (uint16_t)(ADC1->DR & 0x0FFFU);
}

/**
 * @brief Пример инициализации для непрерывного режима
 */
void ADC1_Init_Continuous_PA0(void)
{
    // Выполнить базовую инициализацию
    ADC1_Init_Single_PA0();
    
    // Включить непрерывный режим
    ADC1->CFGR1 |= ADC_CFGR1_CONT;
    
    // Запустить непрерывные преобразования
    ADC1->CR |= ADC_CR_ADSTART;
}

/**
 * @brief Пример использования с прерываниями
 */
void ADC1_Init_WithInterrupt_PA0(void)
{
    // Выполнить базовую инициализацию
    ADC1_Init_Single_PA0();
    
    // Включить прерывание по окончанию преобразования
    ADC1->IER |= ADC_IER_EOCIE;
    
    // Настроить NVIC для ADC1
    NVIC_EnableIRQ(ADC1_IRQn);
    NVIC_SetPriority(ADC1_IRQn, 2);
}

/**
 * @brief Обработчик прерывания ADC1
 * 
 * Должен быть объявлен в отдельном файле или здесь:
 * void ADC1_IRQHandler(void)
 */
void ADC1_IRQHandler(void)
{
    if (ADC1->ISR & ADC_ISR_EOC)
    {
        // Чтение результата (автоматически сбрасывает EOC)
        uint16_t value = (uint16_t)(ADC1->DR & 0x0FFFU);
        
        // Здесь можно обработать значение
        // Например, сохранить в буфер, отправить по UART и т.д.
        
        // Сбросить флаг прерывания (если нужно)
        ADC1->ISR |= ADC_ISR_EOC;
    }
}

/* ========== Пример использования в main() ========== */
/*
int main(void)
{
    // Настройка системной тактовой частоты (если нужно)
    // SystemInit(); // обычно вызывается автоматически
    
    // Инициализация ADC
    ADC1_Init_Single_PA0();
    
    while (1)
    {
        // Чтение значения ADC
        uint16_t adc_raw = ADC1_ReadOnce();
        
        // Конвертация в напряжение (предполагая Vref = 3.3В)
        uint32_t voltage_mv = ADC_ToVoltage_mV(adc_raw, 3300);
        
        // Использование значения...
        // Например, отправка по UART, обработка и т.д.
        
        // Задержка перед следующим измерением
        for (volatile uint32_t i = 0; i < 100000; i++) { __NOP(); }
    }
}
*/
